{"pages":[{"title":"index","text":"##test","link":"/categories/index.html"},{"title":"脑洞","text":"仿生林则徐会销毁电子鸦片吗 2.15 大师永远怀着一颗学徒的心，而学徒已经装着大师的脸出去卖了。 2.16 莽撞地开始，拙列地完成，也好过心怀完美主义而迟迟不动手去做。","link":"/ideas/index.html"},{"title":"吐槽","text":"大师永远怀着一颗学徒的心，而学徒已经装着大师的脸出去卖了。","link":"/ideas/2.15.html"},{"title":"about","text":"本站建立于2021年，曾经使用Wordpress，现在转到静态博客Hexo。网站托管在github pages，使用Icarus主题，对源码做了一些自定义的修改，绑定域名zeroyh.xyz。 为什么选择搭建博客？1.不想用笔和本子记录，太懒不想写字。博客查找方便，记录方便，便于分享传播。没有明确的目的，只想有个地方可以写点东西，不关心PV和UV。 为什么选Hexo？2.静态网站访问快，Hexo已经非常成熟。用黑色背景markdown编辑器写文章逼格高。 为什么选pages托管？3.免费，对学生党来说是相当经济的选择，可以使用少量的钱实现更多的可能。","link":"/about/index.html"},{"title":"tags","text":"","link":"/index/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2022/01/28/hello-world/"},{"title":"picture test","text":"","link":"/2021/08/29/picture-test/"},{"title":"正见 读后感","text":"正见：佛陀的证悟Almost Buddhist作为一本入门级佛教书籍，正见纠正了我对一些佛教词汇的刻板印象。例如佛教徒：我们经常把佛教与祥和、禅定和非暴力联系起来，仿佛红色或黄色的袍子加上平和的笑容就是佛教徒的一切，但事实上如果一个人接受四项真理（即”四法印”：诸行无常、诸漏皆苦、诸法无我、涅槃寂静），他就是佛教徒，佛教徒最关心的是智慧，道德和伦理是次要的，偶尔有一点风流韵事不表示那个人就不能成为佛教徒…诸如此类，举不胜举，在下面的部分中我再一一解释。 为了零基础读懂这本书，首先要对一些专有名词有初步的了解，而且中文译版有个明显的不足就是翻译导致的失真，例如译者在zagchey（情绪）这个词上就很纠结，因此单看标题或者目录真的是一头雾水。 专有名词解释： 空性：暂时没法解释… 出离心：为解脱轮回苦，灭尽诸烦恼（再简单点就是：离苦得乐）之意，出离心基本上是希望从娑婆世界的苦海中解脱出来; 无明：十二因缘起首，一切众生从无始来，种种颠倒，指不能见到世间实相的根本力量，是执着与贪嗔的根源； 究竟涅槃（parinirvana）（《心经》）：指佛陀经过长期的教法在拘尸那城圆寂，更超越了涅槃 ； 业：因果法则，有善业和恶业； 见佛杀佛：若在路上见到佛，杀掉他，真正的佛并非一位为时间和空间所局限的外在救主； 四法谛：苦谛、苦集谛、苦灭谛、苦灭道谛； 说实话，本人初读时毫无头绪，书中的大部分观点似乎都没有逻辑上的硬伤，但由于本人资历不足阅历尚浅，无法一一参透作者的观点，只能简单地总结谈一谈我对每章的理解； 第一章，造作与无常​ 这一章作者的观点很明确，就是强调无常，对于无常的重要性我深有体会，这也是我为什么对这本书产生兴趣的原因。作者从佛陀（乔达摩·悉达多）的故事出发，讲述了他是如何一步步从生活优裕的太子走向菩提树下。 ​ 无论过的是花天酒地还是以泪洗面的生活，我们都要面对生与死的问题，在热闹的生日派对上上我们会把死亡抛到脑后，但夜深人静的时候却又无法摆脱对死亡的恐惧，这就是所有人要面对的无常。 说到无常又不得不提到和合，”一切万有，没有一样是以独立、恒常、纯粹的状态存在的”，所有的事和物都是能被拆分的，树叶能被拆成组织、细胞甚至原子，这也就注定了没有东西是永恒的，解构 无止境。明白了这个道理，我们就不再坐在期待和失望的过山车里起起落落了，而是站在远处看着生命的旅程。 ​ 这其实就相当于开了moba游戏的上帝视角，对”敌方”英雄的动向了如指掌，这样我们就不会被种种假设、僵化的教条和价值体系所奴役，免于受限于个人的情感戏码中。 ​ 为了让我们深入理解和合的道理，作者举了个煮鸡蛋的例子，有了锅有了水有了电，又没有什么电力中断之类的意外发生，想要鸡蛋不煮熟是不可能的，这就是我们常说的因缘。当无数的因缘和合在一起，而且没有干扰与障碍，结果是必然的。很多人把运气独立出去，事实上这就属于我们不可控制的部分，如果抱有太高的期望就容易落空，相反的，如果从一开始我们就把握住了自己所能影响的部分，那接下来的每一步我们都能走的自信而坚强。 ​ 回到开头那个生与死的例子，现在的人认为徐福东渡、炼丹延寿很愚蠢，其实我们批判的不是寻求长生不老本身，而是他们的本质是恒常的信念。那么要如何解除死亡的痛苦呢？答案是真正的解脱来自于领受整个循环，而不是紧紧抓住自己喜欢的部分，财富、健康、和平和他们的反面一样都是暂时的。 第二章 情绪与痛苦​ 佛教典故中，悉达多在菩提树下成功对抗了魔王魔罗的军队，获得解脱而成佛。魔王用来攻击悉达多的就是各种情绪和诱惑化做的箭。 ​ 对于个人来说，每个人每个年龄段追求的快乐都是不尽相同的，因此快乐和痛苦的定义也时有变动，强调适应这种快乐的变化在部分人看来就是”人生的目的”，但仅仅采用外在的方法来获得快乐，却不了解这些方法带来的痛苦，只会得到事与愿违的结果。同样，社会化的快乐，那些基于不同宗教组织、政治制度和文化背景所带来的快乐也是暂时的，一大群人在更大尺度上追求快乐、止息痛苦，就会为了领土、石油、空间、金融市场而征战。 ​ 悉达多发现，追本溯源，导致人痛苦的是人的情绪。一切情绪都生起于自私，也就是说他们都与执着于自我有关。情绪看似真实，但不是一个人本具存在的一部分，只是因与缘巧合下生起的。如果你真的想要根除痛苦，你必须培养觉知，留心你的情绪，并且学习如何避免被鼓动起来。 ​ 佛家有一个词来描述错误的理解，那就是无明，而所有无明的根源就是执着于自我。人们看着色、受、想、行、识的时候，通常制造出一种自我的概念或是标签，并认为他是恒常而真实的。但是悉达多了悟到，无论在形体内还是形体外都找不到一个独立存在的个体（见第一章的无常），而执着于谬误的自我会制造更多的无明，导致各种痛苦和失望。 ​ 认识到这一点，我们就可以开始和自我作战了。现实中，魔罗也在向每个人射来各种各样的箭：欲望之箭、傲慢之箭、自大之箭，以及引发丧失知觉之箭等等，用觉知去对抗这些负面情绪甚至是它们所带来的种族主义、恐怖主义等社会性问题就是我们所要面对的”战役”。 ​ 佛陀说诸漏皆苦，那么爱呢？有的痛苦像嗔恨、嫉妒有明显的负面性质，而其他的比较幽微。父母的爱，朋友的爱，伴侣的爱，我们认为爱在诗词、歌谣中体现的情绪是必要的，但爱也具有不确定和不可预测的性质，如果一个人穷极一生，做了百分之九十九的准备，想方设法掌控所有的因缘，只为得到理想中的爱，那唯一的可能就是被剩下百分之一的障碍所击溃，因为他的期望太高且抱有执念。 ​ 所以只有从一开始就培养对情绪的觉察，限制他们的活动，才能面对危险而不恐惧。不知是恐惧真正的根源。觉知不会妨碍你的生活，反而会让生命更充实。 ​ 实际上，这一章也是作者提出看待问题的世界观，接受诸漏皆苦的观点并不是要我们做没有感情的机器人，而是提醒我们在大喜大悲面前要更加从容，不要被困在”自我”的身体里，不要因为执念而走火入魔，更不要为满足自己”快乐”的需求做伤天害理的事。 ​ 读了这章，我再次体会到为什么说佛教徒崇尚的是一种智慧，为什么爱因斯坦等现代怀疑论科学家也会对悉达多这位王子表示尊敬和敬仰。看似无法理解的观点其实只是一个有点矫枉过正（想不出别的词了）的口号，从情绪一开始出现就保持察觉，这本身也是科学的心理疾病预防手段。诚然作为宗教类书籍他的观点会跟其他教派有碰撞（比如上面cue到基督教主张的爱），但不是妨碍大家抱着辩证理性的态度去学习，完善自己的世界观，顺便种下解决生命中根本问题的种子。 第三章 一切是空​ 在第一章作者讲清楚了什么是无常，如果能够认识和领悟事物的这种本原的空以及事物变化的无常，悟通并进入到一个无我相、无他相、无物相的无我境界时，就是空性。而这一章颇有些唯心的意味，甚至很难用生活经验去理解，因此作者在这一章举的例子也是最多的。 ​ 首先作者抛出了一个典故——密勒日巴的牦牛角，就是西藏最有名的瑜伽圣者能钻到牛角里去，神奇吧，但这戏法又有什么用呢？于是作者告诉我们：钻到牛角里（认识空性）需要超越理性的限制，因为理性也是基于一个非常有限的共同逻辑系统，容许一点点未知进入我们的思维系统才能成为”神圣的狂人”。这时候作者又搬出了时间的概念，我们认为时间是线性的，但又不能说明时间没有起点有没有终点的事实，所以说我们的这种认识只能算不准确的理性。。。总之，以纯理性的观点否定牛角典故和认为有法术能实现这种行为都是扭曲的，”因为否认是一种低估，而盲信是一种高估”。 ​ 好了，结束了最”玄学”的部分，接下来的观点还是比较具有下现实意义的。既然一切都是和合的，那么在分析时加上一个前提条件便是一个不错的选择，这样你就可以避免陷入”真实存在”的陷阱里了。面对一件事或物，如果你考虑到了所有情况，那你还会失望吗？这就是解构，而我们要做的就是把解构培养成本能，无论是在有压力还是在有诱惑的情况下。（这里书中有一处讲相对真理，但是看不懂哈哈哈） ​ 为了让观点和生活紧密结合，作者特地告诉我们这些凡夫俗子：不是外相困住了你，而是你对外相的执著困住了你。书中的例子可谓十分接地气：有个男的喜欢看美女的眼睛，然后美女被看烦了，直接把自己的眼睛掏了出来给他，现场解构教学，一分钟教你认识无常。其实空性的观点并不复杂，看到账单、车子、牙杯，我们很难了解他们的空性，这也很正常，但是我们被资本塑造的奢侈品操纵，被政治立场中的”港独””台独”操纵，被短视频带来的巨大流量操纵，却丝毫没有看出其中的空性，那是不是就相当可笑了呢。 ​ 对于我们这种心智被实用主义所制约的人，了解空性是困难的，因此密勒日巴钻进牦牛角，几乎只被说成寓言而已。但是事实上，不迈出”非理性”的那一步就只能向井底之蛙一样，甚至被”大海”活活吓死。 ​ 说了这么多难以理解的理论，这时候就需要有上师来指点我们了。书中一直在重复一个观点，那就是佛陀只是一个人，一个有智慧的人，一位伟大的老师，而没有去神化他，让他拥有无边法力满足你所有的愿望。佛陀这位老师的特点就是善巧，别的老师布置五三，他根据弟子不同的程度来制定规范、戒律，为的不是惩罚你，怕你下地狱（其实地狱也是编的，没办法就是有人吃这套），而是要你停止纵容自己不善的负面行为和情绪，免于纠结于更多的觉受、疑惧和妄想之中，从而了悟空性。 ​ 如果你还没被绕晕，就会发现佛陀自我矛盾：说他不存在（空性），然后他又教导了道德和救赎。实际上他只是用这种形式让教法变得祥和、易于接受，以免吓走那些尚未准备好，还不能被引介空性的人。然而，如同当你抵达河岸时，你就得抛弃舟一样，你在完全证悟的那一刻必须抛弃佛教。 如果我们有勇气能超越世俗，不被惯常逻辑界线所限制，就能得到利益。 ​ 如果我们能超越界线，就能了解空性是如此可笑的单纯。我们要挑战的是对惯常逻辑、文法、字母、数学公式的执著——只要你记得他们和合的本性，而那时你就会发现一切所依赖的物质都是有弹性、可弯曲的（牦牛角），你对喜恶的观点也会发生变化，从而生起一种责任感和慈悲心。 第四章 涅槃超越概念​ 我们理所应该的把天堂当作”好”死人的聚集处，但如果天堂只是满足每个人的愿望，那里必然也是混乱不堪的，因为大家的喜好不尽相同。而产生这种误会的根本原因在于我们把快乐当成了终极目标，但佛陀指出的道路也并非引导到快乐，相反的，他是一条通往从痛苦、妄念和迷惑中解脱的道路。因此涅槃既非快乐也非不快乐——他超越了一切二元的概念，而这种状态佛教典籍一般用”大乐”来描述，这种状态也是无法同言语表达的。 ​ 平时我们说的上天堂就好比从梦魇中醒来，感到如释重负，但大乐就好比从没做过这个梦。 ​ 除了解释”天堂”的矛盾性，作者还从另外一个角度来告诫我们要丢弃”快乐”：人的欲望是永无止境的，对于不知足的人根本没有终极快乐这一说。构建在快乐至上的人生，基础是脆弱的。 ​ 读了一系列高深莫测理论，很多人可能对于自己的悟性和本性产生了怀疑。这时候作者开始给大家加油打气了，他把我们的本性比作玻璃酒杯，而我们的污染就好比杯子上的指印，没有人生来就是愚痴邪恶的，改邪归正后你还是你。为了探知自己的佛性，作者号召我们生起慈悲心，慈悲就像穿过黑暗风暴的一束光指引着我们。其实我理解的慈悲是在第一章的无常，看清事物的本质之后就能在更高的维度决定自己的行为，看到海边搁浅的”鱼”便会自然而然的想去帮助他们，这不同于盲目的放生为自己积德，以”上天堂”为目的的善行并不能称为慈悲。 ​ 打过气之后又开始了烧脑的环节。证悟是可以超越时间和空间的，他能把整个宇宙置于一粒原子之上（佛土），对于这种益处我 不 理 解。总之，摆脱了二元情绪我们就能放下牵绊，不会沉迷于打扮，不会在意批评等等等。 ​ 书中写道”在世俗世界中，对于证悟最接近的比喻就是自由”，我们做一切努力都是为了自由，择业的自由，穿衣的自由，婚姻的自由…领导人高举自由的旗帜，但如果每个人都被赐予了完全的自由又不知如何是好，因为我们没有勇气和能力来善用自己的自由，反而一直把自己关在责任和规范的牢笼里。 ​ 对于那些下定决心的人作者也有话说。两千五百年的佛教历史上，可能有无数证悟者没有被发现，或因为精神不正常而被放逐，只有极少数的人被赏识为具有所谓”疯狂智慧”，但仔细想想是其实是我们这些评判的人不正常啊。 ​ 我们的语言和分析能力只能达到宇宙这个概念，我们的经验就如同一个史诗般的梦，当你证悟了，你就不用记忆，不用禅定，不用挣扎。佛陀从未说过在你离弃了轮回之后，涅槃才会在那儿出现。轮回之不存在，就是涅槃。证悟就是污染耗尽、污染的对治理也耗尽的结果。最后我们连证悟之道也要抛弃，如果你仍然界定自己为一位佛教徒，那你就还未成佛。 结论​ 这一章不再解释理论，而是用前面的四法印解释我们观察到的现象，顺便纠正一下我们对佛教徒的刻板影响。 ​ 世界上不同的宗教有着各自的见地，也就是核心，除了自己没有人能评判哪个见地比较好。宗教的好坏不是由各自的行为规范来确定的，而是由教徒的心智能力、喜好、感觉及背景决定的，因此我们反对宗教之间的比较和诋毁，但也不提倡混杂不同宗教的观点。 ​ 佛陀规劝弟子不要吃肉，因为吃肉带给另一众生的伤害是不善的，而且吃肉的行为是为了生存——这种生存的欲求和你想要的恒常有关；佛教徒主张布施，是因为不在执着于自我也就不再执着于财富，现实中的钱和梦里的一样，想捐多少捐多少；佛教徒实践非暴力，因为暴力的基本原因来自于执着极端的想法，了解到敌人是被他们自己的无明和嗔恨所控制也就比较容易原谅他们了；有的佛教徒出家苦修，因为他们看清了一切皆苦的本质，保持纯净而节制。 ​ 四真谛和其他用来实践这些真谛的办法就像茶和茶叶，随着佛教的发展，人们不断制作不同风格和厂牌的杯子，但不论杯子多好用，一旦我们忘记了里面的茶杯子就会变成障碍。 收获：写了这么长读后感，看的出来这本书的内容非常翔实而且难以理解，更别说运用了。起初我真的是为了自娱或者说尝尝鲜买的这本书，长时间的阅读对于我这种基本不看书的工科生来说无疑是煎熬的，以我目前的阅历来讲书中的东西很多都是无法求证的，但无论”对错”，作者的观点都给了我思考问题的另一个角度，也能解释佛教徒一些令人迷惑的宗教行为，更重要的是适应了长时间的阅读或者说深度阅读也让我的学习质量又了较大的提升（其实打字速度也提升了）。","link":"/2021/09/19/zhengjian/"},{"title":"“禅与摩托车”","text":"禅与摩托车维修艺术 读后感ZEN AND THE ART OF MOTORCYCLE MAINTENANCE 首先声明，此书内容晦涩，本人三番五次看不下去，只能强行硬啃，在此粗略的做个总结。 读不懂的原因在于我的阅历尚浅，没有深入研究一个领域的经力，这本书更像一瓶灵丹在修炼遇到瓶颈时帮助你完成“质的飞越”，但不适合当成萌新出新手村的教学。 此外，我认为这本书需要一定的哲学基础，起码要对作者提及的几位哲学家（亚里士多德、柏拉图、休谟、康德等）有初步的认识；其次，对于作者的经历可以先不要去了解，如此一来便能保证结尾的精彩，反之，容易在遇到不理解的观点时怀疑作者犯病。 这本书不仅是许多软件开发的参考书，神奇之处更在于它集小说、传记、哲学于一体，将风格、氛围完全迥异的两条故事线完美地融合在一起，采用肖陶扩（Chautauqua）的方式讲述了作者的哲学观，并潜入自己的过去，探寻现代文明下 的精神救赎。 ​ 图1.传统的世界观和作者的世界观 作者认为那个年代（60年代）整个文化的根基已经需要拓展，过去的思维模式已经无法适应新的情况，正如学生碰到数学难题一样，不要原有思路继续走下去，要发散自己的思维，直到碰到一些事能拓展原先知识的根基，才能继续前进。 在此，针对文中令我比较有感悟的几点谈谈我的理解： P126. 逻辑包含归纳法和演绎法：归纳法从现象出发得到普遍的结论；演绎法则从一般的原理推论出特定的结果，比如计算机网络通讯中，ping不ping的通，数据有无发送，就能判断这一层结构是否完好。 而科学方法就是不断运用归纳法和演绎法的结果，需要兼顾一下六个方面： （1）问题是什么； （2）假设问题的原因； （3）证实每个问题的实验方法； （4）预测实验结果； （5）观察实验的结果； （6）由实验得出结论； 这个流程在初一科学第一章就学过了，但我们仔细研究第二步——假设，假设看似简单但可能是无穷无尽的，你需要大量的假设才能从中得到最后的一个真理，因此研究的越深，所做的假设也越多，“科学把人从唯一的真理引向多元混沌的世界，反而制造出反科学的混乱”。 作者表达了他眼中理性的缺陷——”在情感上是空虚的，在美学上是没有任何表现的，而在灵性上更是一片空白“。 P150. -浪漫的人对于理性的诅咒，主要是因为理性以极高的效率把人们从原始的状态中提升出来，有力的主宰了文明世界，因而排除了其他一切。 中国如此重视理工科，正是因为技术的落后引来殖民侵略者的胡作非为，最后大家都成了狂热的理性教徒，以理性思考为核心的数理化在中高考、升学中占据了极高的地位，造就了理性和感性的割裂和不平等。 P178. -对理性缺乏信心，才会成为狂热的研究者。 狂热用佛家的话来讲就是执念，对事物的执念出于不自信，譬如太阳东升西落，正常人就不会对此感到特别的向往，因为你知道这是必然的，但如果我们能把理性最为本能，就不会在苛责自己时时刻刻把理性挂在嘴边，理性只是这个世界中“性价比”最高的组成部分，但不是全部。 P198. -人们越来越注意到科学的丑陋，因而开始怀疑我们是否必须牺牲灵性和美感上的需要，以满足物质方面的欲望。 -基于纯粹二元理性的科技在取得物质胜利的同时却把世界变成了各种流行事物的垃圾场。 现代化的进程势不可挡，这让我想到年前杭州宣布关停大大小小的报刊亭，从政府的角度而言这一做法无疑是利大于弊的，电子书的盛行和生活节奏的加速已经彻底淘汰了报刊，但依然有大批网友为其默哀，我们一边感慨贫瘠的土地长不出热爱阅读的花朵，一边把最后的一点肥料都拿去培养粮食作物。 我们反思城市化带来的冷漠，反思工业化带来的污染，反思智能化带来的疏远，但科技化的进程已如脱缰的野马，没有人能控制的住。 其实我们反对的不是科技，而是和心的疏远，艺术和科技，理性和感觉本应俱为一体，盲目的表露出他丑陋的一面，必然引起人们的厌恶。 以手机市场举例，苹果毋庸置疑是将科技和艺术结合的最完美的，而其他厂商盲目的堆砌参数，最终导致消费者不买单，这也印证了纯理性不等于高收益，承接上一点，也正是苹果在科技上的自信让他有勇气牺牲定价上的优势换取美感。 P228. -废除大学的学分和学位制度 有观点认为现在大学生普遍不够努力是因为上大学的目的只是拿到学位证书，而不是学到内在的知识，因此大家只关注最后的结果（绩点），但不重视学习过程。如果没有了阶段性考试的激励，那不愿意的学的学生不会收到任何惩罚，只会因为越来越跟不上节奏而自己选择退学，但倘若有一天在无聊的工作中被唤醒了学习的本能，那就会变得为了追求真正的知识而学。 P310 -一个事实越普遍，越是值得珍惜。 P328. -通过对良质的认知，古典的理性会有极大幅度的进步，他的意义也会更加深广。（避免修理摩托时“卡住”） 以机械工程为例，在修理设备时你可以通过操作手册和科学方法解决大部分问题，但是如果碰到螺丝卡住这种事呢，操作手册上明显不会写，课本也没有专题讲如何卸螺丝，这时候传统的科学能让你知道自己的困境，也能验证你的知识，但无法告诉你应该往何处去，你所需要的创意、原创力、直觉、想象，都不属于理性的范畴。 这时候你应该消除划分主客观所产生的幻觉（通过调息、打坐等方式），腾空一切杂念，对螺丝重新进行评估，把他变成你的直接经验：你想到螺丝不仅坚硬而且牢固，在加上有螺纹，自然而然就会想到冲击和溶剂的方法。 所以用心是拓展古典理性的关键，一个摸爬滚打试出来的老师傅比科班出身的机械工程师可能更有经验。 这也解释了为什么需要重视基础练习，一位杰出的控球后卫能在球场上做出“花里胡哨”的连招，是因为在他眼中每运一下球都产生了新的理解，而不是像武侠小说中，大侠先喊出整套连招的名字，在打出一套“降龙十八掌”。所有看似高端的技巧都是由基础组成的，你要做的仅仅是打好基础，然后在比赛中静下心来，这时候你的每个选择都已经脱离了理性能给予的范畴，人们只能通过录像回放总结经验，然后拙劣的模仿。 P340. -实际上科技这个词的词根（techne）本来的意思就是艺术。 P346. -“佛陀或是耶稣坐在电脑和变速器的齿轮旁边修行会像坐在山顶和莲花座上一样自在。如果情形不是如此，那无异于亵渎了佛陀——也就是亵渎了你自己。” 平静的三个层次：生理、心理、价值上的平静。 高超的技术人员、艺术家身上你能感觉到古典和浪漫的融合，那种融合不是感性给理性套壳，而是将耐心、关心、专注倾注到手中的工作上，如此一来，在意识的前沿便没有了主客体的分离，物我合一，手随心动。 P355. -希腊人称之为热忱（enthousiasmous）的字面意思是“被神充满（filled with theos）” 进取心（及热情）需要避免落入外在环境因素和内心因素导致的陷阱。 内心的陷阱包括价值的陷阱、自我的陷阱和肌肉的陷阱。 价值的陷阱要求我们跳出功利的范畴重新审视手头上的这件事； 自我的陷阱要求我们不能骄傲，装也要装出谦虚的态度； 焦虑是因为你急于求成，这时你会去修理不需要修理的东西，做出荒谬的结论，造成恶性循环 ——打破恶性循环，把你的焦虑写下来，把焦虑作为动力，记得，你追求的是内心的平静，而不是仅仅把机器修好而已； 枯燥是因为你丧失了从新鲜角度看问题的能力，不再有初学者的虚心，这时候你只要放下手中的活动去休息一下，或者把重复性的工作看做一个仪式。 P372. -感到烦燥的原因是因为你低估了工作所需要的时间。 把整体目标的重要性降低些，具体目标则调高些，这需要价值观的弹性。 P381. -你想知道怎么画一副完美的画吗？很简单，先让自己变得完美，然后再顺其自然画出来，这就是所有专家的方式。 以上内容便是我摘取的比较有感触的点，我把这些话誊抄在便签上，贴在墙上，努力地用自己的经验去连接他们之间若隐若现的线，但是很可惜，可能只要我往后退一步，就能看出他们组成的是什么图案吧，这是一种《2001：太空漫游》中猩猩触碰黑石碑的感觉，一种面对智慧的无力感。","link":"/2022/02/15/%E2%80%9C%E7%A6%85%E4%B8%8E%E6%91%A9%E6%89%98%E8%BD%A6%E2%80%9D/"},{"title":"三月生活帖","text":"这是一篇迟到并且构思了很久的生活帖子，用以记录我一去不复返的2022年3月. 在2022年初，我就计划每逢重大社会事件写一点点个人的看法和感悟，然后年末汇总，迫于考研的压力总是不能如愿，也借此机会简要的谈一谈三月的生活和有趣的见闻。 学习​ 首先是个人学习方面的总结，3月基本上按时完成了考研计划表中要求，进度还算马马虎虎，但是信息交流的方面还很欠缺，之后需要及时弥补。还有一件占据了我大部分时间精力的事便是准备蓝桥杯，历时一个月（到4.9）终于结束，后期贷款式的刷题也占用了很多原本分配给考研的时间，需要及时调整状态。 蓝桥杯（圈钱杯）​ 众所周知，蓝桥杯以高获奖率和高报名费著称，我也是抱着以赛促学的心态来试一试的，不然以我的尿性到了实习估计都不会碰一下。 （以下资料只适用于非计算机专业的算法小白，大佬绕道别骂了QwQ） 课程：ACwing 蓝桥杯专题 书：算法笔记 by 胡凡，曾磊 主编 题单：https://www.acwing.com/activity/content/activity_person/content/14763/5/ 真题：https://www.lanqiao.cn/cup/?sort=students_count&amp;category_id=3&amp;tags=2018 学习网站：https://oi-wiki.org/ ​ https://labuladong.github.io/algo/1/ NFT（以下内容不代表任何投资建议） ​ 对于元宇宙、区块链和NFT的概念，我一个门外汉只在大大小小的推文中有所了解，不幸的是，主流的声音无一例外的对NFT的未来做出了悲观的预测。​ 事实上对于我对于这种新兴的事物并不反感也不痴迷，记得是高二的时候，网易和百度等国内几家互联网巨头推出了各自家的“比特币”，网易的被称为“黑钻”，就类似于QQ农场的玩法，手机开着应用就能自动产出，那时我最期待的事情就是周末回家看看生产了多少，到了后期，黑钻开始能兑换实物，让我印象最深的奖品好像是什么网易养的黑猪肉吧，再到后来我发现没什么意思就放弃了。​ 也就是三月，从校外流传进来一种国内NFT的玩法，具体什么平台我就不透露了，只在一个我认识的小小圈子里流行。​ 众所周知，元宇宙是由两种基本粒子组成的：傻子和骗子，其中傻子围着骗子转。我当然是抱着看傻子的心态看他们玩的，但是玩着玩着，大家都有了不少起色，像一般的产品行情好的话发售价买入就能赚个三四百，更有甚者一单赚了7000+，这对于当事人（玩家）的消费观造成了极大的冲击，当晚就请我吃了顿饭，甚至加了几根烤串。。。​ 我当时忙着准备比赛，只是天天看他们神神叨叨的，一会猛戳手机，一会唉声叹气，虽然赚的多，但大部分时间还是陷在涨跌的苦闷之中的（价格可能一晚上就有500+的落差，极为魔幻）。 ​ 于是我开始反思，所谓的NFT背后的互联网泡沫和认知以内能赚到的钱究竟是怎么样的。以下没有任何参考文献（ 也没有什么参考价值 ），都是我一时兴起写的。 ​ 首先是泡沫的问题，邓紫棋女士曾说过：“阳光下的泡沫 ~ 是彩色的 ~ 就像被骗的我 ~ 是幸福的”，从两千年起互联网就是世界上最大的泡沫产出地。不论是新的概念还是新的技术总能在互联网界掀起一股人人效仿的高潮，在我看来，泡沫就是赋予了一件事物远超其现有价值的价格，就好比农夫发现了一株强壮的幼苗，于是二话不说把幼苗挖出来放到市场上兜售，并夸下海口说这是近年来最优质的品种，仿佛看到了他就看到了秋天的丰收。 ​ 但泡沫就完全是没有价值的吗？从长期来看泡沫只是发展的一个过程，我反对无脑鼓吹的NFT的人，也反对说NFT毫无价值的人。因为NFT本质上一项技术，是web3.0和数字化经济的一个载体，鼓吹和贬低他的人都是从现有的经济的角度出发的，不可否认的是，技术最终都是要落实到生产力的发展上去，但一味的批判反过来显露出了价值观的单一和僵化，谈价值起码要从多个角度出发，这也是辩证思考最基本的要求。 ​ 对于一项技术的发展来说，资本的投入是不可或缺的，币圈大佬在推特上吹吹牛逼，让韭菜往股市砸钱，最后给玩区块链的工程师涨点工资，反过来促进这项技术的发展，本就是正常的发展规律，韭菜亏钱了只能说你的见识太超前了。但就我的了解，国内几家玩NFT的公司就差把搞钱两个字写在脸上了，一张图换个序列号发个几万张，APP连个服务器优化都懒得做，还指望他能发展区块链技术？ 我问身边玩NFT的人： 你们觉得这公司啥时候能倒闭， 答：应该挺不过今年， 问：那还玩？ 答：玩啊，来钱快啊 …… 那他们为什么这么自信能赚到钱(不被骗钱）呢? “这就是认知的力量”。 判断一下以下哪个选项属于靠认知赚到的钱（对于底层韭民来说）： A：2000年一个玩比特币的技术宅不小心在电脑里存了一个比特币； B：收到“小道”消息某科技公司要进军币圈，比特币价格要涨； C: 用各种风水玄学八卦夜观天象推算出明天这个比特币要涨； D：在市场研究一个月，发现只要有新品发售比特币价格就会涨； 你可以说都是也可以说都不是，认为都是：A靠技术、B靠信息、C靠超自然力量、D靠经验，认为都不是：都没有办法保证下一次能用同样的方法赚到钱，有人说D为什么不能保证呢，首先是经验总结，其次只研究了一个月，而且不能保证比特币（类似的产品）不被上头的一纸文书废了，B的话小道消息可能真的不小道。 ​ 人们常说：“人无法赚到认知以外的钱，就算赚到也会赔进去”，哦，这个人们通常指在股市、基金、币圈亏钱了的小韭菜们，这句话对他们是极好的安慰，但你学会提升自己对赚钱的认知不就行了吗？如果你这么想，那成功学大师会拍拍你的脑袋觉得你很有觉悟——被他再噶一刀的觉悟。 ​ 认知可以是对运气的说辞，啊其实我也不知道为啥就是赚了，但是为了显得低调有内涵一点我就说是认知吧。真正靠认知赚钱的人靠不是对投资本体的认知，而是对个人和社会整体的认知，我看好这项技术，我看好这家公司，我想要在互联网发展的进程中增加参与感，于是我投入了资金，而这种对技术价值、公司文化的认同感需要的长期的培养，抱着搞钱的心态玩这种处于泡沫阶段的东西不当韭菜还想当啥，有信仰的韭菜也能愈割愈长，没信仰的韭菜大概率竹篮打水。 ​ 说回到我的态度：不反感也不痴迷，不反感是因为技术本身没有对错好坏之分，不痴迷是因为NFT、区块链之类的东西还没发展到让我这样的外行人看懂的地步。 ​ 而国内NFT平台充斥的满是贪婪和恐惧，尽管现在接触NFT的人还不算多，但一块蛋糕是不可能一直被做大的，平台饱和的那天就是泡沫破裂的时候，搞钱的人都知道这一天会来，但是明天还是十年后的某一天，谁都说不准，欲望和理性的博弈在这个泡泡里被无限放大。 ​ 其实有时间的话，我更愿意看一看区块链的科普，或者看一看经济学家对NFT的分析，而不是跟着一群媒体喊垃圾，跟着一心搞钱的韭民哭天喊地。 我愿称之为理工“福布斯”，一直想有钱上一次。。。 生存主义​ 最近听了一期讲美国末日生存主义的播客，在加上上海疫情严重，物资短缺，不由得反思了一下自身的情况。 ​ 在分工明确的现代化大城市供应链其实并没有想象的那么强大，所以要准备一些生活必备品，药品和卫生用品是硬通货；其次要准备一点干粮在寝室，万一哪天就封校了；最后是锻炼身体，生存主义者中有一个流派叫“鸠派”，专门发展武力抢占别人的物资，正所谓“屯粮不屯枪，你家变粮仓”，武力是生存下去的保障，其实夸张了哈哈哈，健身只是为了强身健体。 （在此立帖为证，希望健身的习惯能坚持下去 4.11起 ） 说了这么多，还是在教室里就着小酒打完的，最后一杯敬生活，愿山河无恙，国泰民安。 -FUCK COVID-","link":"/2022/04/12/%E4%B8%89%E6%9C%88%E7%94%9F%E6%B4%BB%E5%B8%96/"},{"title":"不背单词的正确打开方式","text":"不背单词的正确打开方式众所周知，选择一本适合自己英语水平的单词书是至关重要的。不背单词提供了这样一个比较人性化的功能，即自定义单词书。 优缺点自定义功能有以下优缺点： 优点 省事 ，选词后不用手动编辑词性词义，调用不背官方词库即可； 针对性强，适合考前突击一些高频词汇； 缺点 僵硬 ，不能自定义背词顺序； 上传次数字数为4000； 自带词库中缺少专业词汇； 无法添加词组； 自定义功能介绍自定义词书很简单 对txt.文件的唯一要求是：系统只识别每行第一个单词 复习了长达2min的大一C语言后，我写了个exe将网上下载的 乱序单词书txt 转化成自定义词书 可识别的txt 输入：单词间 有空格 或者 单词首字母为 大写eg.Adhere(黏附, 附着; 坚持, 支持) Cherish(珍爱, 珍视, 爱护)eg.adhere cherisheg.AdhereCherish 输出：Adhere Cherish 下载链接：https://github.com/ZER0YH/Bubeidanci （单次格式转换有字数限制，具体多少我也不清楚。。。） 建议自定义词书是碎片化背词的替代品，但不是很适用于从日常学习中积累新词汇，就好比说你想把今天练的一套习题中的陌生词汇加入自己的电子词书，这在不背单词中操作起来就比较麻烦，建议用其他背词软件，自定义用法适合不背单词重度使用者 有VIP的。","link":"/2021/11/25/%E4%B8%8D%E8%83%8C%E5%8D%95%E8%AF%8D%E7%9A%84%E6%AD%A3%E7%A1%AE%E6%89%93%E5%BC%80%E6%96%B9%E5%BC%8F/"},{"title":"精选软件推荐","text":"2021精选应用推荐​ 经历了一次硬盘损坏和主力机更换后，我意识到优质软件的**”保鲜秘诀”**在于分享。因此，我在使用过的软件中每样挑选一款，作如下推荐： （本人支持正版，以下内容只作为备用资源库使用，用于搜集未删减或是主流平台未上架的资源，且会在24小时内清除使用软件的过程中所产生的版权数据） 书Z-Library ​ Z-Library 登录 (singlelogin.me) 推荐理由： 资源全面，无广告，且支持各种主流电子书格式转换。 Tips： -网站每天的书籍下载次数有限制，普通会员每人每天只能下载10本，高级会员每人每天能下载20本。如果你想成为高级会员，可以通过捐赠1美元的方式获得。 影茶杯狐 茶杯狐 Cupfox - 努力让找电影变得简单 推荐理由： 免费影视聚合资源站点，界面简约干净，资源全面，支持在线播放和下载。 音洛雪音乐 洛雪音乐助手是一款开源免费的跨平台无损音乐下载工具+在线试听软件，其最大的特点是整合了QQ音乐、网易音乐、酷狗、酷我、咕咪音乐等五大音乐平台的搜索、播放、下载功能。 Github：https://github.com/lyswhut/lx-music-desktop#readme 下载链接：https://www.lanzoui.com/b0bf2cfa/ 密码：glqw 推荐理由： 软件本身也支持显示歌词、封面、下载时嵌入封面等功能，用户可以用一个软件处理全网音乐搜索下载的需求，将不再需要在多个音乐平台之间徘徊听歌。 （以网易云用户为例，下载歌曲上传至网易音乐云盘后，网易将自动包装封面和歌词，使用体验极佳） Tips： -下载歌曲须在设置中选中，默认未勾选； -下载歌曲的音质普遍不高，且格式单一，音乐发烧友绕道。 百度文库冰点文库下载器 3.2.12 下载链接：https://wwt.lanzouj.com/b030okupi 密码：52kj 推荐理由： YYDS，不用安装插件，转换正确率高，（虽然说转成PDF，格式不可避免的有些影响），什么Edge阅读模式，什么油猴插件，我李彦宏老师见一个封一个，冰点还活着算是一个奇迹了。 Ps:该版本是我很早之前下载的老版本，现在市面上主流的新版本好像已经不能用了。 虚拟定位Fake Location 1.2.0.5 下载链接：https://wwt.lanzouj.com/b030okx2d 密码：kj25 推荐理由： 校园跑伴侣，理工人手必备，该版本为破解版，若不慎更新到新版本的同学可以下回这个老版本。 *以上应用或链接 2022.1.29 亲测有效","link":"/2022/01/29/%E7%B2%BE%E9%80%89%E8%BD%AF%E4%BB%B6%E6%8E%A8%E8%8D%90/"}],"tags":[],"categories":[]}